toblig1ny/constant/polyMesh/blockMeshDict111
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0.0 1.0 0.0)
    (0.0 2.0 0.0)
    (5.0 0.0 0.0)
    (5.0 1.0 0.0)
    (5.0 2.0 0.0)
    (40.0 0.0 0.0)
    (40.0 1.0 0.0)
    (40.0 2.0 0.0)    
    (0.0 1.0 0.1)
    (0.0 2.0 0.1)
    (5.0 0.0 0.1)
    (5.0 1.0 0.1)
    (5.0 2.0 0.1)
    (40.0 0.0 0.1)
    (40.0 1.0 0.1)
    (40.0 2.0 0.1)
);

blocks
(
    hex (0 3 4 1  8 11 12 9) (20 20 1) simpleGrading (1 1 1)
    hex (3 6 7 4  11 14 15 12) (100 20 1) simpleGrading (2.0 1 1)
    hex (2 5 6 3  10 13 14 11) (100 20 1) simpleGrading (2.0  1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 9 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 14 15 7)
            (5 13 14 6)
        );
    }
    walls
    {
        type wall;
        faces
        (
            
            (1 4 12 9)
            (0 3 11 8)
            (2 5 13 10)
            (4 7 15 12)
            (2 10 11 3)                      
            
        );
    }
    frontAndBack
    { 
        type empty;
        faces
        (    
            (0 3 4 1)
            (8 11 12 9)
            (3 6 7 4)
            (11 14 15 12)
            (2 5 6 3)
            (10 13 14 11)
        );
    }
);


mergePatchPairs
(
);

